Courses/7140/Lectures/Homeworks/7140-homework-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-13 Sun 19:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Adv Software Eng: HW1 Fall 2020</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="CS7140 Adv Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Adv Software Eng: HW1 Fall 2020</h1>
<p>
Home work in this course is done individually, without help from
others.  The due date is announced on the course home page.
</p>

<p>
In this HW1, we are focused on the (i) use of Assertions, (ii) Design
by Contract (DbC), and (iii) fluency in C++ and Java/Kotlin.  We will
have a look at "proper OOP" later on in this course, but for now go
with what you learned in your earlier courses.  We are also assuming
that we are "done" with requirements and specs.
</p>

<p>
The numbers in parens indicate relative importance of subtopics.  They do
not add upto a 100.
</p>


<div id="outline-container-org6c989c4" class="outline-2">
<h2 id="org6c989c4"><span class="section-number-2">1</span> Wiggly Worms in C++</h2>
<div class="outline-text-2" id="text-1">
<p>
[45 points] [C++] The single file <a href="../Examples/Wiggly-Worms/worms-one-file.cpp.html">worms.cpp colorized</a> |
<a href="../Examples/Wiggly-Worms/worms-one-file.cpp">worms.cpp plain</a> implements a grass roots game example of wiggly worms.
See the reference listed below.
</p>

<ol class="org-ol">
<li>(40) Revise it (or write afresh) so that it is in "proper" OOP
form.  Describe the end result and the changes made in a brief
tech (about 2 pages) report.</li>
<li>(10) Write one or two paragraphs reporting on proper OOP form
as you applied it in the code, how you discovered and revised the
classes, and on your experince with the tools you used to carry
out this assignment.</li>
<li>(60) Write entry- and exit-assertions for all the methods, and class
invariants.  You may ignore assertions relating to
<code>ncurses</code>.</li>
<li>(60) There is a design behind this code.  In this HW, document this
using DbC.</li>
<li>(20) The design and code as-given do not "really" do anything
about the z-axis.  Suggest ideas and implement.</li>
<li>(00) It probably has bugs.  Feel free to ignore its bugs (that is,
you are not expected to fix bugs).  If you can, identify them!</li>
</ol>
</div>

<div id="outline-container-org63edb33" class="outline-3">
<h3 id="org63edb33"><span class="section-number-3">1.1</span> Bonus</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>[25 points Bonus] The worms program given above did not use
threads.  Use threads to improve the "look and feel" and revise
your answers to 1.1 through 1.5.</li>

<li>[25 points Bonus] The worms program given above probably has bugs.
Fix it and guarantee that it no longer has bugs.  How will you
convince a skeptic?</li>

<li>[Bonus points help only when you are just below a grading curve for
a given letter.  At the discretion of your instructor.]</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgdc3c592" class="outline-2">
<h2 id="orgdc3c592"><span class="section-number-2">2</span> Condense the Numerical Ranges [CNR]</h2>
<div class="outline-text-2" id="text-2">
<p>
[45 points] [In Java8+, or Kotlin]   
</p>

<ol class="org-ol">
<li>(60) Two designs were presented to the CNR Problem (see the Ref
below).  Neither designs discussed in the Ref did not use DbC.
Redo the design descriptions based on DbC.</li>

<li>(50) Implement these in Java or Kotlin in "proper" OOP form. Later,
we will use this code during discussions/ HW#2 of Testing,
Debugging, etc.</li>

<li>(50) Correctness must be the focus.  Efficiency is important, but a
distant secondary goal.  Include supporting discussion.</li>

<li>(30) Write entry- and exit-assertions for all the methods, longer
than 10 lines, and all class invariants.  For every loop, include a
strong (strongest?) loop invariant.</li>

<li>(20) Include test results for at least 100 examples.  Explain how
you constructed these examples.  Chronologically, in the lectures,
we are yet to cover testing.  [You are welcome to share the test
input/output pairs, but not results.]</li>

<li>(10) Must build cleanly with the latest Java8+ or Kotlin.  Use a
build system of your choice: ant, maven or gradle.</li>

<li>(10) Write one or two paragraphs reporting on proper OOP form as
you applied it in the code, how you discovered and revised the
classes, and on your experience with the tools you used to carry
out this assignment.</li>
</ol>
</div>
</div>



<div id="outline-container-org32f9f17" class="outline-2">
<h2 id="org32f9f17"><span class="section-number-2">3</span> Journal</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>[10 Easy-to-Earn Points] Please maintain a journal for this
homework.  Submit a summary.</li>
</ol>
</div>
</div>

<div id="outline-container-org733e916" class="outline-2">
<h2 id="org733e916"><span class="section-number-2">4</span> Turn In</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Follow all ethical/ scholary traditions of attribution.</li>

<li>Include screenshots, particularly for the Worms program.  Other
than the source code files, put everything else together and
produce <b>one</b> PDF file.</li>

<li>The file named <code>hw1.tar.bzip2</code> should be a compressed tar ball of
all the files related to this homework.  Include the revised/
original source code files so that everything builds cleanly.  I
expect to see sub-directories for each problem.  I expect to be
able to build all the programs by invoking <code>make</code>, &#x2026;, or <code>gradlew
   build</code> at the top level.</li>

<li>Submit on Pilot.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd733a3f" class="outline-2">
<h2 id="orgd733a3f"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, Lecture Notes on <a href="../Design/">Design by Contract</a></li>
<li>Prabhaker Mateti, Lecture Notes on <a href="../Examples/Wiggly-Worms/index.html">Wiggly Worms</a></li>
<li>Prabhaker Mateti, Lecture Notes on <a href="../Examples/Condense-Num-Ranges/">Condense Num Ranges</a></li>
</ol>
</div>
</div>


<div id="outline-container-orgc3177ae" class="outline-2">
<h2 id="orgc3177ae"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2020-09-11
</div>
</body>
</html>
